/*
В подзадаче 1 не более 2000 слов.
В подзадачах 2 и 3 считать, что размер текста не более 10 кБ.
Вариант 9

1. 	Дан файл, содержащий английский текст. Найти в тексте N<=2000 самых длинных слов,
 начинающихся заданной буквой. Записать найденные слова в текстовый файл в порядке невозрастания длины.
  Все найденные слова должны быть разными!

2. 	Дана строка, содержащая английский текст.
 Если в тексте есть слова-палиндромы длиной более 2-х букв, то вывести слова текста в   соответствии с долей гласных,
  в противном случае удалить из слов   текста гласные буквы, продублировать согласные и вывести полученные слова в алфавитном порядке.

3. 	В текстовом файле input.txt записан английский текст.
 Найти в тексте слова, содержащие более семи различных букв, выделить их и указать после каждого такого слова в скобках найденные буквы. 
 Полученный текст записать в файл output.txt. Весь текст, кроме найденных слов, должен остаться неизменным, включая и знаки препинания.
*/